{
    "experiences": [
        {
            "title": "Software Engineer",
            "subtitle": "impact.com",
            "workType": "Fullstack Development",
            "workDescription": [
                "Developed and optimized full-stack features for a SaaS-based partnership automation platform, improving user experience, with CI/CD pipelines for streamlined deployment.",
                "Monitored and diagnosed memory inefficiencies, designing a chunk-based system to reduce RAM usage. Implemented data compression, reducing file size by 32%, and authored documentation for future maintenance.",
                "Unified database management and query processing practices across cross-functional teams, visualizing image dimension data for dynamic graphs and enhancing reporting capabilities."
            ],
            "dateText": "06/2024 – present"
        },
        {
            "title": "System Software Engineer, Grad Researcher",
            "subtitle": "The Ohio State University",
            "workType": "Research & Development",
            "workDescription": [
                "Designed a novel algorithm for dynamic process tracing using Intel Processor Trace (Intel PT) integrated with perf, specifically tailored for applications NGINX and PX4 autopilot for proxy and non-proxy servers, in collaboration with U.S. Navy SBIR/STTR.",
                "Employed advanced processor tracing techniques, including CPU emulators, to collect detailed traces from C and C++ codebases. This streamlined the debloating framework and significantly enhancing overall software efficiency and effectiveness."
            ],
            "dateText": "08/2023 – 05/2024"
        },
        {
            "title": "Software Engineer Intern",
            "subtitle": "Oculii Corp",
            "workType": "Backend Development",
            "workDescription": [
                "Improved operational efficiency by automating the radar system build creation process using python, replacing a cumbersome 7-step manual method with optimized configurations, resulting in a 76% reduction in build creation time.",
                "Performed project version control through the integration of agile Git submodule, resulting in improved collaboration and code management. Elevated development practices by introducing pre-commit hooks within the repository leading to consistent coding patterns."
            ],
            "dateText": "05/2023 – 08/2023"
        },
        {
            "title": "Software Engineer",
            "subtitle": "MakeMyTrip",
            "workType": "Fullstack Development",
            "workDescription": [
                "Developed multi property level calendar module with complete user interface ownership on MakeMyTrip application with 7 million monthly active users on Android, iOS B2C platforms.",
                "Constructed a custom calendar library to remove React-Native-Calendars reducing app bundle size by 120kb, resulted in user retainment.",
                "Achieved recognition as the Ace Performer of the Quarter for the successful revamp of the Mobile Application Dashboard, integrating chain of hotel management and significantly boosting application traffic."
            ],
            "dateText": "07/2020 – 07/2022"
        },
        {
            "title": "Software Engineer Intern",
            "subtitle": "Goibibo",
            "workType": "Mobile App Development",
            "workDescription": [
                "Implemented internationalization for GO-MMT web app, and released to production for 3 languages, streamlining onboarding of native hoteliers, and expanding user base by eliminating language barriers.",
                "Transformed user experience and engagement by seamlessly integrating WhatsApp with the GO-MMT web platform, empowering users to effortlessly receive real-time property updates and booking insights via WhatsApp messaging."
            ],
            "dateText": "03/2020 – 07/2020"
        }
    ]
}